---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostWarning
source: html/50558214-e78b-5f05-c789-15db069cc9b4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostWarning Property

Fabric Sheet is placed completely outside of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricSheetOutSideOfHostWarning { get; }
```